#+title: Advent of Code Day 8 Solution
#+property: header-args :tangle solution.jl

Parsing the file:
#+begin_src julia :session day8 :exports both
using DelimitedFiles
filename = get(ARGS, 1, "sample_input")
input = readdlm(filename, Int) |> i -> digits.(i) |> i -> reverse.(i) |> i -> permutedims(hcat(i...))
#+end_src

#+RESULTS:
: 5×5 Matrix{Int64}:
:  3  0  3  7  3
:  2  5  5  1  2
:  6  5  3  3  2
:  3  3  5  4  9
:  3  5  3  9  0

#+begin_src julia :session day8 :results output :exports both
visible = 0

for x in 1:size(input, 1)
    for y in 1:size(input, 2)
        if ((x == 1 || x == size(input, 1)) || (y == 1 || y == size(input, 2)))
            global visible += 1
        end
    end
end

println(visible)
#+end_src

#+RESULTS:
: 16
